[
    {
        "name": "tron",
        "comm": "wow fuck tron"
    },
    {
        "name": "fucktron",
        "comm": "https://i.redd.it/6xw3fqp4zdp11.png"
    },
    {
        "name": "naegate",
        "comm": "Before this gets deleted by reddit admins, this asshole took it completely out of context. First of all, the idiot thinks it was a marionette deck. It wasn't. That card's not even in the deck. He was running counterspell draw, this was approximately turn 25, every single creature and spell I cast was countered or removed up until that point and this dumbass who copied his deck from MTG Salvation or Goldfish used one of his last copies of negate to counter a Revel in Riches when he had 0 creatures on the field and I had 0 treasures in play, thus the \"this spell does literally nothing\" and he should have let it resolve. I love it when people copy a deck and have no idea how to run it or play MTG. I was just throwing it out because I had 5 mana and it was the only card left in my hand and the game was already over anyway. So on the way out I let him know what an idiot he was for countering a spell that does nothing in the current board state.\n\nNOBODY wants to watch a recording of a game where I cast something and he counters it or removes it x30 turns. That's idiotic. I should have left the game the second I saw what he was running. This was the 5th attempt at getting a recording of something resembling watchable MTG gameplay and 5 people in a row were playing Karn draw control loop or free cast torrential graveyard resurrection control or approach control loop. So yeah, I was pissed and he was an asshole for playing this. He's one of those idiots who doesn't care about the other players one bit, it's all about winning. So running 35 control spells seems reasonable because NOTHING matters but winning. Thanks for not showing the board state with library counts or the full log, asshole. Enjoy your temporary ban from reddit."
    },
    {
        "name": "burn",
        "comm": "4 Goblin Guide\n4 Monastery Swiftspear\n4 Eidolon of the Great Revel\n4 Lightning Bolt\n4 Lightning Helix\n4 Boros Charm\n4 Searing Blaze\n2 Thunderous Wrath\n4 Sunbaked Canyon\n3 Inspiring Vantage\n2 Sacred Foundry\n3 Mountain\n1 Wooded Foothills\n4 Bloodstained Mire\n2 Arid Mesa\n4 Lava Spike\n4 Rift Bolt\n3 Skewer the Critics\n\n2 Ensnaring Bridge\n1 Grim Lavamancer\n2 Rest in Peace\n2 Path to Exile\n2 Skullcrack\n2 Wear // Tear\n1 Deflecting Palm\n2 Exquisite Firecraft\n1 Shattering Spree"
    },
    {
        "name": "test",
        "comm": "test1"
    },
    {
        "name": "test",
        "comm": "test2"
    }
]